chose_from = "<b>اختار من القائمة 🎛</b>"

#جداول المحضرات
term1_Table_of_lectures = "📇 جدول محاضرات الكورس الاول 📇"
term2_Table_of_lectures = "📇 جدول محاضرات الكورس الثاني 📇"

#نصوص يعاد استخدامها
back_term1 = "ارجع الى المواد ⬅️"
back_term2 = "ارجع الى المواد ◀️"
done_forward = "⬆️⬆️🫡"
not_post_yet = "ابوالحسن بعده ما ناشر هذا الملف 🫣."

#ايموجيات 
alg_emj = "📈"
cc_emj = "☁️"
cs_emj = "🛡️"
ds_emj = "🕸"
os_emj = "🐧"
ip_emj = "🖼️"
en_emj = "🇬🇧"
daas_emj = "📊"
iot_emj = "🦾"
ma_emj = "📱"
wp_emj = "🌐"

# متغيرات الكورس الاول
web_prog_title = f"برمجة مواقع {wp_emj}"
algo_lab_title = f"خوارزميات عملي {alg_emj}"
algo_theo_title = f"خوارزميات نضري {alg_emj}"
computer_security_lab_title = f"امن الحاسوب عملي {cs_emj}"
computer_security_theo_title = f"امن الحاسوب نضري {cs_emj}"
operation_systems_lab_title = f"نضم تشغيل عملي {os_emj}"
operation_systems_theo_title = f"نضم تشغيل نضري {os_emj}"
image_process_lab_title = f"معالجة صورية عملي {ip_emj}"
image_process_theo_title = f"معالجة صورية نضري {ip_emj}"
dis_systems_lab_title = f"انضمة موزعة عملي {ds_emj}"
dis_systems_theo_title = f"انضمة موزعة نضري {ds_emj}"

#متغيرات الكورس الثاني
english_title = f"اللغة الانكليزية {en_emj}"
cloud_computing_lab_title = f"حوسبة سحابية عملي {cc_emj}"
cloud_computing_theo_title = f"حوسبة سحابية نضري {cc_emj}"
design_and_analyze_systems_lab_title = f"تصميم وتحليل نظم عملي {daas_emj}"
design_and_analyze_systems_theo_title = f"تصميم وتحليل نظم نضري {daas_emj}"
mobile_applications_lab_title = f"تطبيقات موبايل عملي {ma_emj}"
mobile_applications_theo_title = f"تطبيقات موبايل نضري {ma_emj}"
iot_lab_title = f"انترنيت الاشياء عملي {iot_emj}"
iot_theo_title = f"انترنيت الاشياء نضري {iot_emj}"


#نصوص كثيرة
about_bot_msg = ("<b>● عن بوت @cs_stg4_bot:</b>\n\n"
        "<b>• بوت ملازم وملخصات وأشياء مساعدة لطلاب المرحلة الرابعة قسم علوم الحاسوب في كلية علوم الحاسوب وتكنولوجيا المعلومات جامعة واسط دفعة 2022-2025.</b>\n\n"
        "<b>• البوت يسهل وصول الطالب للمادة وكل شيء يخصها من ملازم أصلية ومترجمة أو ملخصات أو البرامج التي يُطبق عليها الجانب العملي.</b>\n\n"
        "<b>• مصادر البوت هي من القنوات الرئيسية للمرحلة الرابعة دفعة 2022-2025:</b>\n\n"
        "  ⏎ قناة الكورس الثاني: \nرابط القناة: @cs_stg4\n\n"
        "  ⏎ قناة الكورس الأول + ملازم السنة السابقة: \nرابط القناة: @cs_stg4_deleted\n\n"
        "  ⏎ قناة المخلصات + الملازم المترجمة + الأسئلة والحلول: \nرابط القناة: @cs_stg4_onefile\n\n"
        "  ⏎ قناة البرامج: \nرابط القناة: @cs_apps\n\n"
        "<b>• تم إنشاء البوت بتاريخ 2024/8/2 بلغة Python مع مكتبة telebot من برمجة @ab0_alhasan.</b>\n\n"
        "<b>• إذا أعجبك البوت، يمكنك تقييمه من خلال /rating.</b>\n\n\n"
        "<blockquote> <b>• ملاحظات ⚠:</b>\n\n"
        "  • يُستخدم البوت أساسًا عبر الأزرار الموجودة في قائمة التحكم التي تحمل رمز 🎛، بالإضافة إلى الأوامر مثل /start لتحديث البوت و /term1 لعرض قائمة الكورس الأول و /term2 لعرض قائمة الكورس الثاني. يُطلب من المستخدمين عدم إرسال أي رسائل نصية مباشرة إلى البوت.\n\n"
        "  • جميع الرسائل المتبادلة بين المستخدم والبوت تظل سرية تمامًا ولن يتم تحويلها أو مشاركتها مع أي طرف آخر. الاستثناء الوحيد هو عند استخدام أزرار قائمة تقييم البوت، حيث سيتم إرسال تقييمات المستخدم إلى المسؤول عن البوت، @ab0_alhasan، و بأمكانه معرفة المعرف واسم الطالب.\n\n"
        "  • رغم ذلك، يُنصح بعدم كتابة رسائل خاصة وذات أهمية داخل البوت، حيث لا يمكن ضمان حماية 100% للخصوصية في جميع الحالات.</blockquote>\n\n"
        "<b>• السورس كود للبوت مع الملفات:</b> <a href='https://github.com/AboALhasanx/cs.stg4.bot'>https://github.com/AboALhasanx/cs.stg4.bot</a>\n\n"
        "<b>✍🏻 ابـوالــحسـن: @ab0_alhasan</b>")
